public class student {// Имя файла должно совпадать с именем класса
    // Файл: StudentInfo.java
        // Метод main — точка входа в Java-программу
        public static void main(String[] args) {

            // Объявление и инициализация переменной для хранения ФИО студента
            String fullName = "Болат Қаракөз Қайратқызы";

            // Объявление переменной для хранения номера группы
            String group = "ИС-24-12";

            // Объявление переменной для хранения образовательной программы
            String program = "Информационные системы";

            // Вывод заголовка в консоль
            System.out.println("2-курс студенті");

            // Вывод ФИО студента
            System.out.println("ФИО: " + fullName);

            // Вывод группы студента
            System.out.println("Группа: " + group);

            // Вывод образовательной программы
            System.out.println("ОП/Специальность: " + program);
        }
}
